app/views/feeds/index.html.erb

  <% @posts.each do |post| %>
    <% user = User.find_by id: post.user_id %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", nil]]

        <a href="<%=  %>"><img class="bite_pic" src="http://emojipop.net/data/images/emoji_set_487.png" ></a>
        <p class="bite_count"><%= "#{post.bites.count} bites" %></p>
---
SELECT COUNT(*) FROM "bites" WHERE "bites"."post_id" = $1  [["post_id", 4]]