app/controllers/bites_controller.rb

INSERT INTO "bites" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2015-11-08 23:19:25.662178"], ["updated_at", "2015-11-08 23:19:25.662178"]]
---
  def create
    @bite = Bite.create(post_id: 1)