app/controllers/posts_controller.rb

  def index
    @user = User.find(params[:user_id])
    @user_posts = @user.posts.order('created_at DESC')
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 6]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1  ORDER BY created_at DESC  [["user_id", 6]]

  def create
    @user = User.find(params[:user_id])
    @post = Post.new(post_params)
    @post.user_id = params[:user_id]

    if @post.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 6]]
INSERT INTO "posts" ("image_url", "caption", "rating", "restaurant", "location", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def show
    @user = User.find(params[:user_id])
    @post = Post.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]

  def edit
    @user = User.find(params[:user_id])
    @post = Post.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 6]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]

  def update
    @user = User.find(params[:user_id])
    @post = Post.find(params[:id])

    if @post.update(post_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 7]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "posts" SET "rating" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["rating", 2], ["updated_at", "2015-11-06 19:06:32.793141"], ["id", 2]]