app/controllers/posts_controller.rb

  def index
    @user = User.find(params[:user_id])
    @posts = Post.all
---
SELECT "posts".* FROM "posts"