app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email_address" = $1 LIMIT 1  [["email_address", "t@w.com"]]
---
  def create
    user = User.find_by(email_address: params[:email_address])