app/controllers/users_controller.rb

INSERT INTO "users" ("f_name", "l_name", "username", "email_address", "password_digest", "profile_pic_url", "bio", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @user = User.create(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1  ORDER BY created_at DESC  [["user_id", 6]]
---
  def show
    @user = User.find(params[:id])
    @user_posts = @user.posts.order('created_at DESC')

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "users" SET "f_name" = $1, "password_digest" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["f_name", "Nicole"], ["password_digest", "$2a$10$bX0tNqBji3d3f4viOjoLGOKx2JcT.el0tR.6A2BgIl4SNXQTSHmzO"], ["updated_at", "2015-11-05 01:35:03.832391"], ["id", 1]]
---
  def update
    @user = User.find(params[:id])

    if @user.update(user_params)